;; ========================================
;; 本地笔记组织 note-denote.el
;; ========================================
(use-package denote
             :ensure t
             :defer t)


;; ========================================
;; 设置denote笔记文件的默认保存目录
;; ========================================
(setq denote-directory directory-denote-file)


;; ========================================
;; 设置denote笔记文件的更多关键词
;; ========================================
(setq denote-known-keywords '("日记" "生活" "思考" "笔记"))


(provide 'note-denote)
